nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/freemaster_examples/fmstr_any/pin_mux.h
/*
 * Copyright 2020 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * FreeMASTER Example Application - Demo code configuration file
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIOC0 (number 3), Y1[1]/EXTAL
  @{ */
#define BOARD_EXTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_EXTAL_PIN 0U              /*!<@brief GPIOC pin index: 0 */
#define BOARD_EXTAL_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC1 (number 4), Y1[3]/XTAL
  @{ */
#define BOARD_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOD6 (number 9), U14C[9]/TXD_BDM
  @{ */
#define BOARD_TXD_BDM_GPIO GPIOD          /*!<@brief GPIO device name: GPIOD */
#define BOARD_TXD_BDM_PIN 6U              /*!<@brief GPIOD pin index: 6 */
#define BOARD_TXD_BDM_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOD5 (number 10), U13[3]/RXD_BDM
  @{ */
#define BOARD_RXD_BDM_GPIO GPIOD          /*!<@brief GPIO device name: GPIOD */
#define BOARD_RXD_BDM_PIN 5U              /*!<@brief GPIOD pin index: 5 */
#define BOARD_RXD_BDM_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOC3 (number 11), U15[26]/Boot_RXD0
  @{ */
#define BOARD_Boot_RXD0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_Boot_RXD0_PIN 3U              /*!<@brief GPIOC pin index: 3 */
#define BOARD_Boot_RXD0_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOC2 (number 5), U15[25]/Boot_TXD0
  @{ */
#define BOARD_Boot_TXD0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_Boot_TXD0_PIN 2U              /*!<@brief GPIOC pin index: 2 */
#define BOARD_Boot_TXD0_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOC12 (number 59), J18[3]/CANRX
  @{ */
#define BOARD_CAN_RX_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_CAN_RX_PIN 12U              /*!<@brief GPIOC pin index: 12 */
#define BOARD_CAN_RX_PIN_MASK kGPIO_Pin12 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOC11 (number 58), J18[1]/CANTX
  @{ */
#define BOARD_CAN_TX_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_CAN_TX_PIN 11U              /*!<@brief GPIOC pin index: 11 */
#define BOARD_CAN_TX_PIN_MASK kGPIO_Pin11 /*!<@brief PORT pin mask */
                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
